
op_questions = [
    {
        "text": "1) Дії при настанні випадку травматизму?",
        "options": [
            ("Оцінити ситуацію, надати домедичну допомогу, сповістити працівника", True),
            ("Продовжити роботу", False),
            ("Не повідомляти нікого", False)
        ]
    },
    {
        "text": "2) Яку назву потрібно вказати при оформленні лікарняного?",
        "options": [
            ("ТОВ «АС МАНУФАКТУРИНГ»", True),
            ("Інша компанія", False),
            ("Не знаю", False)
        ]
    },
    {
        "text": "3) Гасити вогнегасниками можна електрообладнання яке під напругою?",
        "options": [
            ("Водяним", False),
            ("Вуглекислотним", True),
            ("Порошковим", True)
        ]
    },
    {
        "text": "4) Як безпечно вивільнити людину від дії струму?",
        "options": [
            ("Знеструмити ділянку", True),
            ("Потягнути за руку", False),
            ("Облити водою", False)
        ]
    },
    {
        "text": "5) З яких розділів складається посадова інструкція?",
        "options": [
            ("Обов’язки", True),
            ("Права", True),
            ("Кваліфікаційні вимоги", True),
            ("Відповідальність", True)
        ]
    },
    {
        "text": "6) Куди рухатись при екстрених ситуаціях?",
        "options": [
            ("До евакуаційного виходу та йти до місця збору", True),
            ("Ховатися під стіл", False),
            ("Бігти у протилежний бік", False)
        ]
    },
    {
        "text": "7) Чому важливо оцінити ситуацію?",
        "options": [
            ("Я можу зашкодити своїми діями", True),
            ("Щоб нічого не пропустити", False),
            ("Зняти відео", False)
        ]
    },
    {
        "text": "8) Хто має право проводити інструктажі з ОП?",
        "options": [
            ("Безпосередній керівник", True),
            ("Будь-хто", False),
            ("Інспектор ДСНС", False)
        ]
    },
    {
        "text": "9) Порядок приведення в дію вогнегасника?",
        "options": [
            ("Зірвати пломбу, витягти чеку, спрямувати розтруб, натиснути важіль", True),
            ("Натиснути кнопку", False),
            ("Облити водою", False)
        ]
    },
    {
        "text": "10) Періодичність інструктажів з ОП?",
        "options": [
            ("Не рідше одного разу на квартал", True),
            ("Раз на рік", False),
            ("Раз на тиждень", False)
        ]
    },
    {
        "text": "11) Які вогнегасники використовують на виробництві?",
        "options": [
            ("Порошкові", True),
            ("Вуглекислотні", True),
            ("Водяні", False)
        ]
    },
    {
        "text": "12) Вимоги безпеки після роботи?",
        "options": [
            ("Прибрати робоче місце", True),
            ("Вимкнути обладнання", True),
            ("Ігнорувати залишки", False)
        ]
    },
    {
        "text": "13) Які види інструктажів проводяться?",
        "options": [
            ("Первинний", True),
            ("Повторний", True),
            ("Цільовий", True),
            ("Позаплановий", True)
        ]
    },
    {
        "text": "14) Алгоритм при пожежі, яку не загасити?",
        "options": [
            ("Вимкнути електрику, евакуюватись, викликати 101", True),
            ("Залишитись", False),
            ("Зняти відео", False)
        ]
    },
    {
        "text": "15) Дії при загрозі небезпеки?",
        "options": [
            ("Припинити роботу, повідомити інших, покинути зону", True),
            ("Ігнорувати", False),
            ("Продовжити", False)
        ]
    },
    {
        "text": "16) Умови виникнення вогню?",
        "options": [
            ("Температура, кисень, горючі матеріали", True),
            ("Газ і повітря", False),
            ("Бензин", False)
        ]
    },
    {
        "text": "17) Дії при хімічних опіках?",
        "options": [
            ("Промити водою 10 хв, викликати 103", True),
            ("Намазати кремом", False),
            ("Нічого не робити", False)
        ]
    },
    {
        "text": "18) Що таке виробнича травма?",
        "options": [
            ("Отримана під час виконання обов'язків", True),
            ("Вдома", False),
            ("Спортивна", False)
        ]
    },
    {
        "text": "19) Що робити при погіршенні стану?",
        "options": [
            ("Оцінити стан, прийняти ліки, викликати 103", True),
            ("Ігнорувати", False),
            ("Піти додому", False)
        ]
    },
    {
        "text": "20) Як пересуватись сходами?",
        "options": [
            ("Наступати на кожну сходинку", True),
            ("Бігти", False),
            ("Стрибати", False)
        ]
    },
    {
        "text": "21) Що з цього правильне?",
        "options": [
            ("Заборонено додавати сторонні засоби до аптечки", True),
            ("Можна все додавати", False),
            ("Аптечка не потрібна", False)
        ]
    },
    {
        "text": "22) Адреса заводу?",
        "options": [
            ("Вулиця Сечені 76", True),
            ("Проспект Миру", False),
            ("Площа Перемоги", False)
        ]
    },
    {
        "text": "23) Хто відповідає за безпеку без інженера?",
        "options": [
            ("Я сам", True),
            ("Ніхто", False),
            ("Відділ кадрів", False)
        ]
    },
    {
        "text": "24) Особливість струму?",
        "options": [
            ("Не видно й не чути до контакту", True),
            ("Його видно", False),
            ("Має запах", False)
        ]
    },
    {
        "text": "25) Пріоритети Ajax Systems?",
        "options": [
            ("Безпека → Якість → Кількість", True),
            ("Швидкість → Прибуток", False),
            ("Релакс", False)
        ]
    },
    {
        "text": "26) Колега скаржиться на головний біль?",
        "options": [
            ("До медсестри або викликати 103", True),
            ("Дати кави", False),
            ("Ігнорувати", False)
        ]
    },
    {
        "text": "27) Що робити при зауваженні з безпеки?",
        "options": [
            ("Написати Near Miss, повідомити керівника", True),
            ("Проігнорувати", False),
            ("Сфотографувати", False)
        ]
    }
]
general_questions = [
    {
        "text": "1) Який з датчиків фотографує зловмисника?",
        "options": [
            ("Leaks Protect", False),
            ("MCO", True),
            ("Mcam", True),
            ("DP", False)
        ]
    },
    {
        "text": "2) Чи спрацює тривога якщо зафарбувати або замаскувати лінзи MPO і MCO?",
        "options": [
            ("Так, в MCO та MPO встановлена система антимаскінг", True),
            ("Ні", False),
            ("Лише в MPO", False),
            ("Лише в MCO", False)
        ]
    },
    {
        "text": "3) За що відповідає департамент Debug/Repair?",
        "options": [
            ("Пакування продукції", False),
            ("Забезпечення швидкого ремонту плат та девайсів на всіх етапах виробництва", True),
            ("Контроль роботи охорони", False),
            ("Проєктування нових девайсів", False)
        ]
    },
    {
        "text": "4) DCO – це бездротовий вуличний двонаправленний датчик руху типу штора",
        "options": [
            ("Ні", False),
            ("Так", True),
            ("Це клавіатура", False),
            ("Це сенсор диму", False)
        ]
    },
    {
        "text": "5) Чим відрізняється WS та WSD?",
        "options": [
            ("WSD для 7–24В", True),
            ("WS для мережі 220В", True),
            ("WS має сирену", False),
            ("WSD працює на батарейках", False)
        ]
    },
    {
        "text": "6) Чи реагують датчики на тварин?",
        "options": [
            ("Так, частково (до 20 кг і 50 см)", True),
            ("Ні, ніколи", False),
            ("Тільки на собак", False),
            ("Тільки вночі", False)
        ]
    },
    {
        "text": "7) Пристрої які ми виготовляємо, можна поділити на групи:",
        "options": [
            ("Захист від вторгнення", True),
            ("Пожежа", True),
            ("Затоплення", True),
            ("Дистанційне управління", True)
        ]
    },
    {
        "text": "8) Девайс МРР – це:",
        "options": [
            ("Датчик руху з мікрохвильовим сенсором", True),
            ("Сенсор температури", False),
            ("Централь управління", False),
            ("Датчик затоплення", False)
        ]
    },
    {
        "text": "9) За що відповідає департамент SMT-монтаж?",
        "options": [
            ("Візуальний контроль", False),
            ("Поверхневий монтаж SMD-компонентів за допомогою YAMAHA", True),
            ("Транспортування плат", False),
            ("Охорона складу", False)
        ]
    },
    {
        "text": "10) Що відбувається на дільниці внутрішньосхемного тестування?",
        "options": [
            ("Тест плат та прошивка", True),
            ("Запайка проводів", False),
            ("Збірка корпусів", False),
            ("Програмування HUB", False)
        ]
    },
    {
        "text": "11) Чим відрізняється КРР та КР?",
        "options": [
            ("КРР має зчитувач карток", True),
            ("КР — лише клавіатура", True),
            ("КР працює без батарей", False),
            ("КРР не має клавіш", False)
        ]
    },
    {
        "text": "12) Хто такий працівник FNI?",
        "options": [
            ("Quality Technician Final Inspection", True),
            ("Начальник складу", False),
            ("Служба охорони", False),
            ("Майстер ділянки", False)
        ]
    },
    {
        "text": "13) Water Stop — це:",
        "options": [
            ("Кран перекриття води з дистанційним керуванням", True),
            ("Клапан подачі газу", False),
            ("Сенсор диму", False),
            ("Датчик температури", False)
        ]
    },
    {
        "text": "14) З якими девайсами працює HUB HYBRID?",
        "options": [
            ("З дротовими", True),
            ("З бездротовими", True),
            ("Тільки з ретрансляторами", False),
            ("Лише з клавіатурами", False)
        ]
    },
    {
        "text": "15) Чим відрізняється FP та FPP?",
        "options": [
            ("У FPP є CO сенсор", True),
            ("FP реагує тільки на дим", True),
            ("FPP — це клавіатура", False),
            ("FP має камеру", False)
        ]
    }
]
general_questions += [
    {
        "text": "16) 8 видів втрат:",
        "options": [
            ("Запаси", True),
            ("Очищення скла", False),
            ("Знеструмлення", False),
            ("Зволікання з оплатою", False)
        ]
    },
    {
        "text": "17) Завдяки чому відбувається пайка компонентів на селективному монтажі?",
        "options": [
            ("Селективна лінія", True),
            ("Лінія просвітлення", False),
            ("Робот-мийка", False),
            ("Піч сушіння", False)
        ]
    },
    {
        "text": "18) Чи може централь працювати без електрики?",
        "options": [
            ("Так, до 15 год", True),
            ("Ні", False),
            ("Лише 5 хв", False),
            ("Тільки з генератором", False)
        ]
    },
    {
        "text": "19) Де вперше присвоюється QR-код девайсу?",
        "options": [
            ("Дільниця внутрішнього тестування", True),
            ("Склад", False),
            ("Лінія пакування", False),
            ("QC", False)
        ]
    },
    {
        "text": "20) Чи можна налаштувати роботу датчиків за сценарієм?",
        "options": [
            ("Так", True),
            ("Ні", False),
            ("Залежить від моделі", False),
            ("Лише для камер", False)
        ]
    },
    {
        "text": "21) Лінійка пристроїв Ajax включає:",
        "options": [
            ("Провідні", True),
            ("Сонячні", False),
            ("Вуличні ліхтарі", False),
            ("Картриджі", False)
        ]
    },
    {
        "text": "22) Яка дальність зв’язку з датчиком у HUB?",
        "options": [
            ("До 2000м", True),
            ("200м", False),
            ("500м", False),
            ("Без обмежень", False)
        ]
    },
    {
        "text": "23) Чим відрізняється DP та DPP?",
        "options": [
            ("DPP — на удари, нахили, вібрацію", True),
            ("DP має GPS", False),
            ("DP — без сенсорів", False),
            ("Немає різниці", False)
        ]
    },
    {
        "text": "24) Дільниця QC/PKG займається:",
        "options": [
            ("Перевіркою функцій", True),
            ("Техобслуговуванням", False),
            ("Монтажем", False),
            ("Лакуванням", False)
        ]
    },
    {
        "text": "25) Що таке Poka-yoke?",
        "options": [
            ("Захист від помилок", True),
            ("Зарядний пристрій", False),
            ("Назва модуля", False),
            ("Тип акумулятора", False)
        ]
    },
    {
        "text": "26) Які пристрої працюють на OS Malevich?",
        "options": [
            ("Централі", True),
            ("Датчики", False),
            ("Лампи", False),
            ("Сирени", False)
        ]
    },
    {
        "text": "27) Ціль ощадливого виробництва:",
        "options": [
            ("Ліквідувати втрати", True),
            ("Збільшити об'єми", False),
            ("Оптимізувати зарплати", False),
            ("Розширити площі", False)
        ]
    },
    {
        "text": "28) Який датчик реагує на розбиття скла?",
        "options": [
            ("Glass Protect", True),
            ("Leaks Protect", False),
            ("Fire Protect", False),
            ("Motion Protect", False)
        ]
    },
    {
        "text": "29) Функції FPP:",
        "options": [
            ("Повідомляє про CO", True),
            ("Сканує RFID", False),
            ("Працює як ретранслятор", False),
            ("Знімає відео", False)
        ]
    },
    {
        "text": "30) Основна функція Rex/Rex2?",
        "options": [
            ("Розширення радіус дії між централью і девайсами", True),
            ("Підключення до інтернету", False),
            ("Живлення хаба", False),
            ("Заряджання батарей", False)
        ]
    }
]
general_questions += [
    {
        "text": "31) Чим відрізняється MPC і DCO?",
        "options": [
            ("MPC — для приміщення", True),
            ("DCO — для складу", False),
            ("MPC має камеру", False),
            ("DCO — аналоговий", False)
        ]
    },
    {
        "text": "32) Для чого потрібна стандартизація?",
        "options": [
            ("Покращення довгострокової діяльності", True),
            ("Зменшення витрат", False),
            ("Розширення складу", False),
            ("Заміна персоналу", False)
        ]
    },
    {
        "text": "33) Якщо датчик зірвати, чи буде повідомлення?",
        "options": [
            ("Так, через тампер", True),
            ("Ні, тільки при пошкодженні", False),
            ("Лише при втраті зв'язку", False),
            ("Лише з фотофіксацією", False)
        ]
    },
    {
        "text": "34) Датчик затоплення?",
        "options": [
            ("Leaks Protect", True),
            ("Fire Protect", False),
            ("Glass Protect", False),
            ("Motion Protect", False)
        ]
    },
    {
        "text": "35) PIR-сенсор є в:",
        "options": [
            ("Кожному датчику руху", True),
            ("Лише в FPP", False),
            ("Лише в SS", False),
            ("В модулях керування", False)
        ]
    },
    {
        "text": "36) MCO — вуличний датчик з фотофіксацією?",
        "options": [
            ("Так", True),
            ("Ні", False),
            ("Тільки в серії Plus", False),
            ("Лише внутрішній", False)
        ]
    },
    {
        "text": "37) Що таке Brandplate?",
        "options": [
            ("Лицьова панель SSDD для зображення", True),
            ("Задня кришка хаба", False),
            ("Додатковий сенсор", False),
            ("Блок живлення", False)
        ]
    },
    {
        "text": "38) Чи можуть деякі датчики працювати без хабу?",
        "options": [
            ("Так, FP", True),
            ("Ні", False),
            ("Тільки в тестовому режимі", False),
            ("Лише з прошивкою 2.0", False)
        ]
    },
    {
        "text": "39) МР — це:",
        "options": [
            ("Датчик руху, що фіксує вторгнення", True),
            ("Клавіатура", False),
            ("Централь", False),
            ("Детектор вогню", False)
        ]
    },
    {
        "text": "40) Чи працює МР у темряві?",
        "options": [
            ("Так, завдяки ІЧ-сенсору", True),
            ("Ні", False),
            ("Лише з підсвіткою", False),
            ("Тільки вдень", False)
        ]
    },
    {
        "text": "41) Як приходить сповіщення про тривогу?",
        "options": [
            ("Push, SMS", True),
            ("Лише через додаток", False),
            ("По email", False),
            ("Через сайт", False)
        ]
    },
    {
        "text": "42) AJAX — це компанія з розробки систем безпеки?",
        "options": [
            ("Так", True),
            ("Ні", False),
            ("Лише програмне забезпечення", False),
            ("Лише навчальний центр", False)
        ]
    },
    {
        "text": "43) СР — це:",
        "options": [
            ("Комбінований датчик руху і скла", True),
            ("Централь", False),
            ("Сирена", False),
            ("Термодатчик", False)
        ]
    },
    {
        "text": "44) Різниця МРО і МСО?",
        "options": [
            ("МСО має фотофіксацію", True),
            ("МРО — зовнішній", False),
            ("МРО має сирену", False),
            ("МСО — бездротовий пульт", False)
        ]
    },
    {
        "text": "45) MСAM — це:",
        "options": [
            ("Датчик руху з камерою", True),
            ("Централь", False),
            ("Мікрофон", False),
            ("Бездротовий ретранслятор", False)
        ]
    }
]
general_questions += [
    {
        "text": "46) Послідовність створення девайсу?",
        "options": [
            ("SMT → Монтаж → Напівфабрикат → Готова продукція", True),
            ("SMT → Готова продукція", False),
            ("Тест → Монтаж → Пайка", False),
            ("Лакування → Упаковка → Тест", False)
        ]
    },
    {
        "text": "47) HUB / HUB PLUS / HUB 2 / HUB 2 PLUS — це:",
        "options": [
            ("Централі системи безпеки", True),
            ("Датчики руху", False),
            ("Камери", False),
            ("Пульти управління", False)
        ]
    },
    {
        "text": "48) Life Quality Sensor фіксує:",
        "options": [
            ("Температуру", True),
            ("Вологість", True),
            ("CO2", True),
            ("Рівень шуму", False)
        ]
    },
    {
        "text": "49) Що означає Fibra?",
        "options": [
            ("Дротове підключення", True),
            ("Безпровідна мережа", False),
            ("Пластикова оболонка", False),
            ("Сенсор диму", False)
        ]
    },
    {
        "text": "50) Який припій використовують?",
        "options": [
            ("Безсвинцевий", True),
            ("Свинцевий", False),
            ("Мідний", False),
            ("Алюмінієвий", False)
        ]
    },
    {
        "text": "51) Jeweller — це:",
        "options": [
            ("Радіотехнологія до 2000 м", True),
            ("Шифрувальний протокол", False),
            ("Тестовий режим", False),
            ("Назва центрального хабу", False)
        ]
    },
    {
        "text": "52) Wings — це технологія для:",
        "options": [
            ("Mcam", True),
            ("MCO", True),
            ("Glass Protect", False),
            ("Leaks Protect", False)
        ]
    },
    {
        "text": "53) Fibra — це:",
        "options": [
            ("Технологія дротових пристроїв", True),
            ("Тип бездротового сигналу", False),
            ("Сенсор диму", False),
            ("Механічне реле", False)
        ]
    },
    {
        "text": "54) Етапи PDCA:",
        "options": [
            ("Плануй", True),
            ("Виконуй", True),
            ("Перевіряй", True),
            ("Дій", True)
        ]
    },
    {
        "text": "55) Після MasterBox пристрої йдуть на:",
        "options": [
            ("Склад готової продукції", True),
            ("Повернення", False),
            ("Тестування", False),
            ("Утилізацію", False)
        ]
    },
    {
        "text": "56) Скільки департаментів на виробництві?",
        "options": [
            ("5", True),
            ("3", False),
            ("7", False),
            ("10", False)
        ]
    },
    {
        "text": "57) Відповідність ISO:",
        "options": [
            ("ISO 9001", True),
            ("ISO 14001", True),
            ("ISO 45001", True),
            ("ISO 20022", False)
        ]
    },
    {
        "text": "58) Функції SC:",
        "options": [
            ("Керування охороною", True),
            ("Сигнал тривоги", True),
            ("Монтаж пристроїв", False),
            ("Зчитування карт", False)
        ]
    },
    {
        "text": "59) Keypad Combi — це:",
        "options": [
            ("Бездротова клавіатура з карткою/брелком", True),
            ("Камера", False),
            ("Пульт керування", False),
            ("Тестовий прилад", False)
        ]
    },
    {
        "text": "60) Завдання експериментально-технічного департаменту?",
        "options": [
            ("Масштабування процесів", True),
            ("Пайка компонентів", False),
            ("Збірка плат", False),
            ("Пошук помилок", False)
        ]
    },
    {
        "text": "61) Який % пристроїв проходить контроль?",
        "options": [
            ("100%", True),
            ("50%", False),
            ("10%", False),
            ("Вибірково", False)
        ]
    },
    {
        "text": "62) Де відбувається лакування плат?",
        "options": [
            ("Департамент монтажу", True),
            ("Департамент тестування", False),
            ("Комора", False),
            ("В офісі", False)
        ]
    },
    {
        "text": "63) SS — це:",
        "options": [
            ("Сирена, що реагує на тривогу і тампер", True),
            ("Сенсор руху", False),
            ("Централь", False),
            ("Клавіатура", False)
        ]
    },
    {
        "text": "64) Канбан — це:",
        "options": [
            ("Система «точно в строк»", True),
            ("Виробник лінз", False),
            ("Техніка пайки", False),
            ("Програма охорони", False)
        ]
    },
    {
        "text": "65) Чи може HUB надсилати тривогу без інтернету?",
        "options": [
            ("Так, через SIM-карту", True),
            ("Ні, лише Wi-Fi", False),
            ("Лише через Ethernet", False),
            ("Через Bluetooth", False)
        ]
    },
    {
        "text": "66) Де зародилось Lean-виробництво?",
        "options": [
            ("Японія", True),
            ("США", False),
            ("Німеччина", False),
            ("Китай", False)
        ]
    },
    {
        "text": "67) Політика якості Ajax базується на:",
        "options": [
            ("Врахуванні ризиків", True),
            ("Зменшенні витрат", False),
            ("Рекламі", False),
            ("Контролі постачальника", False)
        ]
    },
    {
        "text": "68) Департамент якості відповідає за:",
        "options": [
            ("Тести", True),
            ("Аналіз дефектів", True),
            ("Контроль процесів", True),
            ("Видачу форменого одягу", False)
        ]
    },
    {
        "text": "69) Що таке Цінність згідно Lean?",
        "options": [
            ("Якість продукту, що важлива для клієнта", True),
            ("Кількість виробленого", False),
            ("Залучення нових працівників", False),
            ("Витрати підприємства", False)
        ]
    }
]
lean_questions = [
    {
        "text": "1) Що таке Втрата?",
        "options": [
            ("Будь-яка виробнича дія", False),
            ("Діяльність, яка не змінює сировину, інформацію, продукт відповідно до вимог замовника, але забирає ресурси", True),
            ("Оцінка ефективності процесу", False),
            ("Ремонт обладнання", False)
        ]
    },
    {
        "text": "2) Яке з наступних тверджень є правильним щодо принципу 'Система витягування' (Pull process)?",
        "options": [
            ("Продукт виготовляється партіями", False),
            ("Продукція створюється заздалегідь і зберігається", False),
            ("Виробництво базується на фактичному попиті замість прогнозів", True),
            ("Фокус лише на обсязі виробництва", False)
        ]
    },
    {
        "text": "3) Що можна віднести до втрати 'Дефекти'?",
        "options": [
            ("Результати аналізу", False),
            ("Поломка комплектуючої під час роботи", True),
            ("Самі дефекти", True),
            ("Технічне обслуговування", False)
        ]
    },
    {
        "text": "4) Що таке впорядкування?",
        "options": [
            ("Процес прибирання", False),
            ("Заміна інструментів", False),
            ("Розміщення інструментів, потрібних для роботи, щоб їх легко взяти та повернути", True),
            ("Оцінка продуктивності", False)
        ]
    },
    {
        "text": "5) Який з наступних принципів є частиною Lean?",
        "options": [
            ("Стратегія масштабування", False),
            ("Постійне вдосконалення (кайдзен)", True),
            ("Аутсорсинг", False),
            ("Максимальне навантаження персоналу", False)
        ]
    },
    {
        "text": "6) Що таке Транспортування у контексті втрат?",
        "options": [
            ("Облік транспортних витрат", False),
            ("Зайве переміщення, яке не додає цінності продукту", True),
            ("Доставка товару клієнту", False),
            ("Логістичний ланцюг", False)
        ]
    },
    {
        "text": "7) Що таке втрата через очікування?",
        "options": [
            ("Тривалий цикл виробництва", False),
            ("Це період, протягом якого не створюється цінність внаслідок очікування на дію або рішення", True),
            ("Затримка поставки", False),
            ("Відсутність зв’язку", False)
        ]
    },
    {
        "text": "8) Що таке Цінність згідно з Lean?",
        "options": [
            ("Внутрішня оцінка продукції", False),
            ("Кількість витраченого часу", False),
            ("Якість продукту або послуги, що корисна для кінцевого клієнта", True),
            ("Вартість у грошовому еквіваленті", False)
        ]
    },
    {
        "text": "9) Які цілі має ощадливе виробництво?",
        "options": [
            ("Оптимізувати управління", False),
            ("Позбутися всіх видів втрат і ліквідувати дії, що витрачають час і ресурси", True),
            ("Підвищити обсяг виробництва", False),
            ("Зменшити кількість працівників", False)
        ]
    },
    {
        "text": "10) Назвіть правильну послідовність кроків інструменту 5S:",
        "options": [
            ("Стандартизація → Сортування → Впорядкування → Слідування → Чистота", False),
            ("Сортування → Впорядкування → Чистота → Стандартизація → Слідування", True),
            ("Чистота → Сортування → Слідування → Впорядкування → Стандартизація", False),
            ("Впорядкування → Сортування → Чистота → Стандартизація → Слідування", False)
        ]
    },
    {
        "text": "11) Що таке зайві або надлишкові рухи?",
        "options": [
            ("Робота з перервами", False),
            ("Зміна інструментів", False),
            ("Будь-який рух людей або машин, який не додає вартості товару чи послузі", True),
            ("Підвищення активності працівників", False)
        ]
    },
    {
        "text": "12) Що є основною проблемою, яку вирішує концепція Lean?",
        "options": [
            ("Відсутність планування", False),
            ("Неефективні процеси і надлишкові витрати", True),
            ("Проблеми з логістикою", False),
            ("Нестача персоналу", False)
        ]
    },
    {
        "text": "13) Які цілі має методика 5S?",
        "options": [
            ("Зменшення нещасних випадків, підвищення якості, продуктивності та прибутку", True),
            ("Інтенсифікація роботи", False),
            ("Розширення асортименту", False),
            ("Оптимізація закупівель", False)
        ]
    },
    {
        "text": "14) Що таке сортування?",
        "options": [
            ("Переоблік інструментів", False),
            ("Очищення від пилу", False),
            ("Перегляд всього на робочому місці з метою розділення на потрібне і непотрібне", True),
            ("Оновлення документації", False)
        ]
    },
    {
        "text": "15) Що таке чистота/сяяння?",
        "options": [
            ("Заміна меблів", False),
            ("Полірування деталей", False),
            ("Очищення вентиляції", False),
            ("Встановлення стандартів прибирання, щоб уникнути безладу", True)
        ]
    },
    {
        "text": "16) Який інструмент використовується для боротьби із втратою творчого потенціалу працівників?",
        "options": [
            ("Автоматизація процесів", False),
            ("Щомісячні звіти", False),
            ("Група в Telegram 'ЄідеЯ'", True),
            ("Планування ресурсів", False)
        ]
    }
]
import random

hard_questions = [
    {
        "text": "Який правильний QR-код для DoorProtect?",
        "options": [
            ("DP – b032 w031", False),
            ("DP – b011 w012", False),
            ("DP – b682 w681", False),
            ("DP – w011 b012", True),
        ]
    },
    {
        "text": "Який правильний QR-код для FireProtect Plus?",
        "options": [
            ("FP+ – b032 w031", False),
            ("FP+ – b0a2 w0a1", False),
            ("FP+ – w091 b092", True),
            ("FP+ – b091 w092", False),
        ]
    },
    {
        "text": "Який правильний QR-код для ReX 2?",
        "options": [
            ("RX2 – w461 b462", True),
            ("RX2 – b0a2 w0a1", False),
            ("RX2 – b461 w462", False),
            ("RX2 – b6f2 w6f1", False),
        ]
    },
    {
        "text": "Який правильний QR-код для CombiProtect?",
        "options": [
            ("CP – w081 b082", True),
            ("CP – b081 w082", False),
            ("CP – b022 w021", False),
            ("CP – b0d2 w0d1", False),
        ]
    },
    {
        "text": "Який правильний QR-код для DPF.MBR?",
        "options": [
            ("DPF – b082 w081", False),
            ("DPF – b611 w612", False),
            ("DPF – b142 w141", False),
            ("DPF – w611 b612", True),
        ]
    },
    {
        "text": "Який правильний QR-код для HomeSiren Fibra?",
        "options": [
            ("HSF – b751 w752", False),
            ("HSF – b012 w011", False),
            ("HSF – w751 b752", True),
            ("HSF – b462 w461", False),
        ]
    },
    {
        "text": "Який правильний QR-код для KeyPad?",
        "options": [
            ("KP – b6f2 w6f1", False),
            ("KP – b0a1 w0a2", False),
            ("KP – b462 w461", False),
            ("KP – w0a1 b0a2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для FireProtect?",
        "options": [
            ("FP – b092 w091", False),
            ("FP – w031 b032", True),
            ("FP – b031 w032", False),
            ("FP – b682 w681", False),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionCam?",
        "options": [
            ("MC – b682 w681", False),
            ("MC – w0d1 b0d2", True),
            ("MC – b612 w611", False),
            ("MC  – b0d1 w0d2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для KeyPad Fibra?",
        "options": [
            ("KPF – b0a2 w0a1", False),
            ("KPF – b062 w061", False),
            ("KPF – w6a1 b6a2", True),
            ("KPF – b6a1 w6a2", False),
        ]
    },
]
hard_questions += [
    {
        "text": "Який правильний QR-код для DPPF?",
        "options": [
            ("DPPF – b612 w611", False),
            ("DPPF – b0a2 w0a1", False),
            ("DPPF – w6f1 b6f2", True),
            ("DPPF – b6f1 w6f2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для GlassProtect Fibra?",
        "options": [
            ("GPF – b1b2 w1b1", False),
            ("GPF – w641 b642", True),
            ("GPF – b682 w681", False),
            ("GPF – b462 w461", False),
        ]
    },
    {
        "text": "Який правильний QR-код для StreetSiren?",
        "options": [
            ("SS – b062 w061", False),
            ("SS – b142 w141", False),
            ("SS – b642 w641", False),
            ("SS – w141 b142", True),
        ]
    },
    {
        "text": "Який правильний QR-код для StreetSiren DoubleDeck?",
        "options": [
            ("SSDD – b1b1 w1b2", False),
            ("SSDD – b6d2 w6d1", False),
            ("SSDD – b022 w021", False),
            ("SSDD – w1b1 b1b2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionProtect?",
        "options": [
            ("MP – b6d2 w6d1", False),
            ("MP – b752 w751", False),
            ("MP – b012 w011", False),
            ("MP – w021 b022", True),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionProtect Fibra?",
        "options": [
            ("MPF – b6d2 w6d1", False),
            ("MPF – b621 w622", False),
            ("MPF – b062 w061", False),
            ("MPF – w621 b622", True),
        ]
    },
    {
        "text": "Який правильний QR-код для CombiProtect Fibra?",
        "options": [
            ("CP_F – b062 w061", False),
            ("CP_F – b681 w682", False),
            ("CP_F – b622 w621", False),
            ("CP_F – w681 b682", True),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionCam Fibra?",
        "options": [
            ("MCP_F – b642 w641", False),
            ("MCP_F – w6d1 b6d2", True),
            ("MCP_F – b012 w011", False),
            ("MCP_F – b082 w081", False),
        ]
    },
    {
        "text": "Який правильний QR-код для MPC_MBR?",
        "options": [
            ("MPC – b061 w062", False),
            ("MPC – b682 w681", False),
            ("MPC – b612 w611", False),
            ("MPC – w061 b062", True),
        ]
    },
    {
        "text": "Тип QR-коду для MPO_MBR:",
        "options": [
            ("MPO – b131 w132", False),
            ("MPO – b132 w131", False),
            ("MPO – b0d2 w0d1", False),
            ("MPO – bнемає w131", True),
        ]
    },
]
hard_questions += [
    {
        "text": "Тип QR-коду для Transmitter:",
        "options": [
            ("TRS – b062 w061", False),
            ("TRS – b622 w621", False),
            ("TRS – b112 w111", False),
            ("TRS – b112 w немає", True),
        ]
    },
    {
        "text": "Тип QR-коду для Relay:",
        "options": [
            ("RL – b122 w немає", True),
            ("RL – b6d2 w6d1", False),
            ("RL – b121 w122", False),
            ("RL – b122 w121", False),
        ]
    },
    {
        "text": "Тип QR-коду для WallSwitch:",
        "options": [
            ("WS – b1f2 w немає", True),
            ("WS – b1f2 w1f1", False),
            ("WS – b082 w081", False),
            ("WS – b142 w141", False),
        ]
    },
    {
        "text": "Тип QR-коду для uartBridge:",
        "options": [
            ("UART – 6- ти значний", True),
            ("UART – b622 w621", False),
            ("UART – b112 w немає", False),
            ("UART – b642 w641", False),
        ]
    },
    {
        "text": "Тип QR-коду для MCO_MBR:",
        "options": [
            ("MCO – b642 w641", False),
            ("MCO – bнемає w181", True),
            ("MCO – b0d2 w0d1", False),
            ("MCO – b181 w182", False),
        ]
    },
    {
        "text": "Тип QR-коду для DCO_MBR:",
        "options": [
            ("DCO – b0a2 w0a1", False),
            ("DCO – b немає w1a1", True),
            ("DCO – b622 w621", False),
            ("DCO – b032 w031", False),
        ]
    },
    {
        "text": "Тип QR-коду для HUB Hybrid (Fibra):",
        "options": [
            ("HUB_F – b2800 w1800", True),
            ("HUB_F – b1012 w1011", False),
            ("HUB_F – b1032 w1031", False),
            ("HUB_F – b1082 w1081", False),
        ]
    },
    {
        "text": "Який правильний QR-код для Button?",
        "options": [
            ("BTN – w0c1 b0c2", True),
            ("BTN – b141 w142", False),
            ("BTN – b451 w452", False),
            ("BTN – b1600 w2600", False),
        ]
    },
    {
        "text": "Який правильний QR-код для SpaceControl?",
        "options": [
            ("SC – b1a00 w2a00", False),
            ("SC – b071 w072", False),
            ("SC – b141 w142", False),
            ("SC – w0b1 b0b2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для Double Button?",
        "options": [
            ("DB – b191 w192", False),
            ("DB – b041 w042", False),
            ("DB – w421 b422", True),
            ("DB – b421 w422", False),
        ]
    },
]
hard_questions += [
    {
        "text": "Який правильний QR-код для GlassProtect?",
        "options": [
            ("GP – b1e1 w1e2", False),
            ("GP – b421 w422", False),
            ("GP – b1600 w2600", False),
            ("GP – w041 b042", True),
        ]
    },
    {
        "text": "Який правильний QR-код для LeaksProtect?",
        "options": [
            ("LP – b041 w042", False),
            ("LP – b152 w151", False),
            ("LP – b051 w052", False),
            ("LP – w051 b052", True),
        ]
    },
    {
        "text": "Який правильний QR-код для Socket?",
        "options": [
            ("SKT – w1e1 b1e2", True),
            ("SKT – b0b1 w0b2", False),
            ("SKT – b041 w042", False),
            ("SKT – b1e1 w1e2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для Keypad Combi?",
        "options": [
            ("KPC – b0b1 w0b2", False),
            ("KPC – b071 w072", False),
            ("KPC – b041 w042", False),
            ("KPC – w431 b432", True),
        ]
    },
    {
        "text": "Який правильний QR-код для VHF Bridge?",
        "options": [
            ("VHF – b141 w142", False),
            ("VHF – b451 w452", False),
            ("VHF – w451 b452", True),
            ("VHF – b0b1 w0b2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для MultiTransmitter?",
        "options": [
            ("MT – b1200 w2200", False),
            ("MT – b1100 w2100", False),
            ("MT – b191 w192", False),
            ("MT – w1c1 b1c2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для KPP.001.MBR001v12?",
        "options": [
            ("KPP – b141 w142", False),
            ("KPP – b1e1 w1e2", False),
            ("KPP – b071 w072", False),
            ("KPP – w191 b192", True),
        ]
    },
    {
        "text": "Який правильний QR-код для ReX?",
        "options": [
            ("RX – b071 w072", False),
            ("RX – b1600 w2600", False),
            ("RX – w071 b072", True),
            ("RX – b431 w432", False),
        ]
    },
    {
        "text": "Який правильний QR-код для HB2.MBR_4G?",
        "options": [
            ("HB2 – b051 w052", False),
            ("HB2 – b071 w072", False),
            ("HB2 – b1600 w2600", False),
            ("HB2 – w1a00 b2a00", True),
        ]
    },
    {
        "text": "Який правильний QR-код для StreetSiren?",
        "options": [
            ("SSN – w141 b142", True),
            ("SSN – b0c1 w0c2", False),
            ("SSN – b421 w422", False),
            ("SSN – b1e1 w1e2", False),
        ]
    },
]
hard_questions += [
    {
        "text": "Який правильний QR-код для HUB_07?",
        "options": [
            ("HUB07 – b1e1 w1e2", False),
            ("HUB07 – w1100 b2100", True),
            ("HUB07 – b1a00 w2a00", False),
            ("HUB07 – b0b1 w0b2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для HUB2 MBR?",
        "options": [
            ("HUB2 – b191 w192", False),
            ("HUB2 – b1500 w2500", False),
            ("HUB2 – w1500 b2500", True),
            ("HUB2 – b0c1 w0c2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для HUB_Plus_MBR?",
        "options": [
            ("HUBP – b451 w452", False),
            ("HUBP – w1200 b2200", True),
            ("HUBP – b0b1 w0b2", False),
            ("HUBP – b1a00 w2a00", False),
        ]
    },
    {
        "text": "Який правильний QR-код для Hub 2 Plus?",
        "options": [
            ("H2P – w1600 b2600", True),
            ("H2P – b041 w042", False),
            ("H2P – b051 w052", False),
            ("H2P – b1100 w2100", False),
        ]
    },
]
